# AddLines Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndexStreamLine..::..AddLines Method
IndexStreamLine Class See Also
---
Inserts multiple IndexLine segments into the stream and associated buffer.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public void AddLines(
	IList<IndexLine> lines
)
```

Visual Basic
---
```text
Public Sub AddLines ( _
	lines As IList(Of IndexLine) _
)
```

Visual C++
---
```text
public:
void AddLines(
	IList<IndexLine^>^ lines
)
```

# ### Parameters
lines
    Type: System.Collections.Generic..::..IList<(Of <(<'IndexLine>)>)> The line segments to be inserted.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space. |

# See Also
IndexStreamLine Class
Autodesk.Revit.DB.DirectContext3D Namespace